<template>
  <div>
    <h2>
      이메일무단수집거부
    </h2>

    <h3>정보통신망법 제 50조의 2 (전자우편주소의 무단 수집행위 등 금지)</h3>
    <ul>
      <li>
        누구든지 전자우편주소의 수집을 거부하는 의사가 명시된 인터넷 홈페이지에서 자동으로
        전자우편주소를 수집하는 프로그램 그 밖의 기술적 장치를 이용하여 전자우편주소를 수집하여서는
        아니된다.
      </li>
      <li>
        누구든지 제1항의 규정을 위반하여 수집된 전자우편주소를 판매·유통하여서는 아니된다.
      </li>
      <li>
        누구든지 제1항의 및 제2항의 규정에 의하여 수집·판매 및 유통이 금지된 전자우편주소임을 알고
        이를 정보전송에 이용하여서는 아니된다.
      </li>
    </ul>
    <p>
      ※ 만일, 위와 같은 기술적 조치를 사용한 이메일주소 무단수집 피해를 당하신 경우 불법스팸
      대응센터 전용전화(국번없이 02-1336)나 홈페이지( www.spamcop.or.kr )의 신고 창을 통하여
      신고하기 바랍니다.
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
